---
kind: type
id: T:Autodesk.Revit.DB.ModelHermiteSpline
source: html/39cd643d-a325-ff29-36ff-3c04724e1fb8.htm
---
# Autodesk.Revit.DB.ModelHermiteSpline

Represents a ModelHermiteSpline within Autodesk Revit.

## Syntax (C#)
```csharp
public class ModelHermiteSpline : ModelCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
ModelCurve::geometryCurve property.